[net]
batch=32
subdivisions=1
width=112
height=112
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

mixup=4
mosaic=1

learning_rate=0.00025
burn_in=1000
max_batches = 252000
policy=steps
steps=100000, 200000
scales=.1, .1


[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-2
activation=linear

[convolutional]
batch_normalize=1
filters=48
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-2
activation=linear


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=12
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 4,5
anchors = 10,22, 17,57, 31,34, 35,79, 73,42, 75,93
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=leaky

[upsample]
stride=2


[route]
layers=-1, 4


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=12
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 3, 4
anchors = 10,22, 17,57, 31,34, 35,79, 73,42, 75,93
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=leaky



[upsample]
stride=2

[route]
layers=-1, 1


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=12
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 0,1
anchors = 10,22, 17,57, 31,34, 35,79, 73,42, 75,93
classes=1
num=6
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

