[net]
batch=64
subdivisions=1
width=224
height=224
channels=3
momentum=0.9
decay=0.0005
angle=0
saturation = 1.5
exposure = 1.5
hue=.1

mixup=4
mosaic=1

learning_rate=0.00025
burn_in=1000
max_batches = 252000
policy=steps
steps=100000, 200000
scales=.1, .1

[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=16
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=32
size=3
stride=2
pad=1
activation=leaky


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-2
activation=linear

[convolutional]
batch_normalize=1
filters=48
size=3
stride=2
pad=1
activation=leaky

[convolutional]
batch_normalize=1
filters=48
size=3
stride=1
pad=1
activation=leaky

[shortcut]
from=-2
activation=linear


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 6,7,8
anchors = 18.98,40.68, 27.7,105.14, 47.64,65.06, 48.,151.66, 79.6,95.6, 88.76,178.4, 136.74,43.72, 162.52,104.82, 163.98,196.38
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=leaky

[upsample]
stride=2


[route]
layers=-1, 5


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 3, 4, 5
anchors = 18.98,40.68, 27.7,105.14, 47.64,65.06, 48.,151.66, 79.6,95.6, 88.76,178.4, 136.74,43.72, 162.52,104.82, 163.98,196.38
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

[route]
layers=-3

[convolutional]
batch_normalize=1
filters=16
size=1
stride=1
pad=0
activation=leaky

[upsample]
stride=2

[route]
layers=-1, 2


[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=leaky

[convolutional]
filters=18
size=1
stride=1
pad=0
activation=linear

[yolo]
mask = 0,1,2
anchors = 18.98,40.68, 27.7,105.14, 47.64,65.06, 48.,151.66, 79.6,95.6, 88.76,178.4, 136.74,43.72, 162.52,104.82, 163.98,196.38
classes=1
num=9
jitter=.3
ignore_thresh = .7
truth_thresh = 1
focal_loss = 1
iou_loss = giou
random=1

